[
  {"title": "My Updated Post",
    "content": "My first updated post!\r\n\r\nThis is exciting!",
    "user_id": 1},
  {"title": "A Second Post",
    "content": "This is a post from a different user...",
    "user_id": 2},
  {"title": "Top 5 Programming Languages",
    "content" : " I have read somewhere that programmers should learn a new programming language every year ( I think it's code complete, not sure, though), but if you cannot do so, I suggest to at least learn the following five programming languages to do well in your career. Everybody loves polyglot programmer and an all-rounder who is versatile enough to write a quick script and can also write complex Java programs. In fact, it's almost mandatory for a senior developer to learn more than one language. Interviewers are giving more attention to an engineer who has good experience with multiple languages like C++ and Java go quite well, so is Python and Java. I personally like Software Engineers who have substantial experience in either C++ or Java and can write scripts in Groovy, Perl, or Python.\n\nRead more: https://javarevisited.blogspot.com/2018/08/5-programming-language-every-programmer-learn.html#ixzz6Gy2ZFnjf",
    "user_id": 1},
  {"title": "Sublime Text Tips and Tricks",
   "content" : "As a web developer, we would frequently do code editing. Below are some handy keyboard shortcuts that allow you do different types of selections in SublimeText.for further details https://www.hongkiat.com/blog/sublime-text-tips/",
    "user_id": 1},
  {"title": "Best Python IDEs",
    "content" : "1) PyCharm\n\n\nPayCharm is a cross-platform IDE used for Python programming. This editor can be used on Windows, macOS, and Linux. This software contains API that can be used by the developers to write their own Python plugins so that they can extend the basic functionalities.\n\nPrice: Free\n\nFeatures:\n\nIt is an intelligent Python code editor supports for CoffeeScript, JavaScript, CSS, and TypeScript.\nProvides smart search to jump to any file, symbol, or class.\nSmart Code Navigation\nIt offers quick and safe refactoring of code.\nIt allows you to access PostgreSQL, Oracle, MySQL, SQL Server, and many other databases from the IDE.\nDownload Link: https://www.jetbrains.com/pycharm/\n\n2) Spyder\n\n\nSpyder is a scientific integrated development environment written in Python. This software is designed for and by scientists who can integrate with Matplotlib, SciPy, NumPy, Pandas, Cython, IPython, SymPy, and other open-source software. Spyder is available through Anaconda (open-source distribution system) distribution on Windows, macOS, and Linux.\n\nPrice: Free\n\nFeatures:\n\nAllows you to run Python code by cell, line, or file.\nPlot a histogram or time-series, make changes in dateframe or numpy array.\nIt offers automatic code completion and horizontal/vertical splitting.\nFind and eliminate bottlenecks\nAn interactive way to trace each step of Python code execution.\nDownload Link: https://www.spyder-ide.org/\n\n3) IDLE\n\n\nIDLE (Integrated Development and Learning Environment) is a default editor that comes with Python. This software helps a beginner to learn Python easily. IDLE software package is optional for many Linux distributions. The tool can be used on Windows, macOS, and Unix.\n\nPrice: free\n\nFeatures:\n\nSearch multiple files\nIt has an interactive interpreter with colorizing of input, output, and error messages.\nSupports smart indent, undo, call tips, and auto-completion.\nEnable you to search and replace within any window.\nDownload Link: https://docs.python.org/3/library/idle.html\n\n4) Sublime Text 3\n\n\nSublime Text 3 is a code editor which supports many languages including Python. It has basic built-in support for Python. Customization of Sublime Text 3 is available for creating create a full-fledged Python programming environment. The editor supports OS X, Windows, and Linux operating systems.\n\nPrice: Free Trial ",
    "user_id": 1},
  {"title": "Flask vs Django - Which Is Better?",
    "content" : " A web developer has option to choose from a wide range of web frameworks while using Python as server-side programming languages. He can take advantage of the full-stack Python web frameworks to accelerate development of large and complex web applications by availing a number of robust features and tools. Likewise, he can also opt for micro and lightweight Python web frameworks to build simple web applications without putting extra time and effort.\n\nBoth Django and Flask are hugely popular among Python programmers. Django is a full-stack web framework for Python, whereas Flask is a lightweight and extensible Python web framework. Django is developed based on batteries-included approach. It enables programmers to accomplish common web development tasks without using third-party tools and libraries. Django lacks some of the robust features provided by Python.",
    "user_id": 2}
]
